Table of Contents
 Class ConcreteBlockData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the single concrete block
public class ConcreteBlockData
Inheritance
object
ConcreteBlockData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AxisX
LCS - Axis X
public Vector3D AxisX { get; set; }
Property Value
Vector3D
 AxisY
LCS - Axis Y
public Vector3D AxisY { get; set; }
Property Value
Vector3D
 AxisZ
LCS - Axis Z
public Vector3D AxisZ { get; set; }
Property Value
Vector3D
 Center
Center of the concrete block LCS
public Point3D Center { get; set; }
Property Value
Point3D
 Depth
Depth of the concrete block
public double Depth { get; set; }
Property Value
double
 Id
Plate unique ID
public int Id { get; set; }
Property Value
int
 Material
Name of the material
public string Material { get; set; }
Property Value
string
 Name
Name of the concrete block
public string Name { get; set; }
Property Value
string
 Origin
Origin of the concrete block LCS
public Point3D Origin { get; set; }
Property Value
Point3D
 OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
public string OriginalModelId { get; set; }
Property Value
string
 OutlinePoints
Outline points
public List<Point2D> OutlinePoints { get; set; }
Property Value
List<Point2D>
 Region
Geometry of the concrete block in svg format
public string Region { get; set; }
Property Value
string
 Edit this page